; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-5)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	image2 - mode
	spectrograph1 - mode
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image2)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 image2)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 spectrograph1)
	(supports instrument8 image2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(pointing satellite1 GroundStation2)
	(have_image Star3 thermograph0)
	(have_image Phenomenon5 image2)
	(have_image Phenomenon6 image2)
	(have_image Star7 thermograph0)
	(have_image Phenomenon8 image2)
	(have_image Planet9 spectrograph1)
))

)

; plan
1. (turn_to satellite2 groundstation0 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 groundstation0)
   goals met: 1 of 8
2. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 1 of 8
3. (calibrate satellite2 instrument8 groundstation0)
   added: (calibrated instrument8)
   goals met: 1 of 8
4. (turn_to satellite2 planet9 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet9)
   goals met: 1 of 8
5. (take_image satellite2 planet9 instrument8 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 2 of 8
6. (turn_to satellite2 phenomenon5 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon5)
   goals met: 2 of 8
7. (take_image satellite2 phenomenon5 instrument8 image2)
   added: (have_image phenomenon5 image2)
   goals met: 3 of 8
8. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   goals met: 3 of 8
9. (take_image satellite2 phenomenon6 instrument8 image2)
   added: (have_image phenomenon6 image2)
   goals met: 4 of 8
10. (turn_to satellite2 star7 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star7)
   goals met: 4 of 8
11. (take_image satellite2 star7 instrument8 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 5 of 8
12. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   goals met: 6 of 8
13. (turn_to satellite2 phenomenon8 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon8)
   goals met: 6 of 8
14. (take_image satellite2 phenomenon8 instrument8 image2)
   added: (have_image phenomenon8 image2)
   goals met: 7 of 8
15. (turn_to satellite2 star3 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star3)
   goals met: 7 of 8
16. (take_image satellite2 star3 instrument8 thermograph0)
   added: (have_image star3 thermograph0)
   goals met: 8 of 8
